{
    "pages": [{
        "pageID": "1",
        "pagetitle": "You are in a Void.",
        "pagecontent": "<p>When you look around you see nothing. You have never seen another person or thing here... only the button. Every time you get close to the button you feel nauseous. You feel a sinking feeling in the pit of your stomach.</p> <p>This dark place feels unlike any other dream you have ever had. Time moves as if you are counting every second until your alarm goes off.</p><p> Every night you are given the same choice. To press the button or not. You have not pressed it for months because of how getting close to it makes you feel. It feels wrong. But you cannot take it for much longer. Maybe tonight you will finally press it.</p><p>You stand in front of the button. You feel like you are about to throw up. Your hand hovers above the button.</p>",
        "pageimg": "images/PtB-center.jpg",
        "color": "#ea5a54",
        "pagechoice": [{
            "choicecontent": "Press the button",
            "nextPageID": "2"
        }, {
            "choicecontent": "Wait until you wake up and refuse to press the button",
            "nextPageID": "A"
        }]
    }, {
        "pageID": "1.1",
        "pagetitle": "You are in a Void. Again.",
        "pagecontent": "<p>Here. Again? You wonder how you got here. This means that is a place and is not a dream? If that is the case, then where are you? Why does getting close to the button always make you feel so queasy?</p><p>That pit in your stomach is the only reason you have yet to push the button. You think back to the last few seconds. Oh god. Did you just die? You vomit on the floor.</p><p>You look around for the millionth time. There is nothing but darkness. Nothing but the void and the button. You have nothing to lose and nowhere to go.</p><p>Your hand hovers just above the button. </p>",
        "pageimg": "images/PtB-center.jpg",
        "color": "#ea5a54",
        "pagechoice": [{
            "choicecontent": "Press the button",
            "nextPageID": "2"
        }]
    }, {
        "pageID": "1.2",
        "pagetitle": "You are in a Void. Again.",
        "pagecontent": "<p>Seriously? Here? Again? You look around for the millionth time. There is nothing but darkness. Nothing but the void and the button. There is no exit and you need to sleep. It no longer matters how it makes you feel. If pressing this thing means you finally get to rest, it is time to do it. You have put it off for long enough. You have nothing to lose and nowhere to go. </p><p>Your hand hovers just above the button.</p>",
        "pageimg": "images/PtB-center.jpg",
        "color": "#ea5a54",
        "pagechoice": [{
            "choicecontent": "Press the button",
            "nextPageID": "2"
        }]
    }, {
        "pageID": "2",
        "pagetitle": "Transported",
        "pagecontent": "<p>You are transported into a bright field of tall green grasses and wildflowers you have never seen before.</p><p>You are on a gravel path. As you follow the path, you hear the sound of the pebbles shifting beneath your feet and feel the lightly-scented, fresh air brush against your skin.</p><p>At the top of a hill, there is a sign next to the path that reads:</p><p>&quot;Welcome, traveler. You are now leaving Voidspace. Welcome to the Crossroads Realm. You are currently at realm access point JX-27-Orange-Quokka-93.&quot;</p><p>In the distance, you see a tall stone structure that looks pristine yet ancient.</p>",
        "pageimg": "images/to-the-portal-realm.jpg",
        "color": "#4b4e22",
        "pagechoice": [{
            "choicecontent": "Walk towards the structure in the distance",
            "nextPageID": "3"
        }]
    }, {
        "pageID": "3",
        "pagetitle": "Portal Realm",
        "pagecontent": "<p>As you walk closer, you see three arches light up before you. In each archway, there is an incongruous scene with the world around you. The structure looks ancient yet the what is on the other side of this portal is completely different. It is as if you are peering into different worlds, different parts and maybe even times in the universe. After a few calming breaths, you approach the structure.</p>",
        "pageimg": "images/portalrealm.jpg",
        "color": "#5289bd",
        "pagechoice": [{
            "choicecontent": "Walk towards the arch on the left",
            "nextPageID": "3L"
        }, {
            "choicecontent": "Walk towards the center arch",
            "nextPageID": "3C"
        }, {
            "choicecontent": "Walk towards the arch on the right",
            "nextPageID": "3R"
        }]
    }, {
        "pageID": "3L",
        "pagetitle": "Whispers in the Dark",
        "pagecontent": "<p>Before you is the remains of a crumbling remains of an old stone structure. There is green overgrowth sprawling across every stone making the space, although empty, inviting. There is a calming feeling about this place. You hear the trickle of a stream pouring over the steps that somehow stop at the archway entrance. If you peer further into the portal, for that is surely what these are, there is a floating emerald at the top of the source of the stream in the abandoned building. As you see it, it glows, illuminating a long stretch of hallway or aquaduct. That's when the whispers start. At first, it feels like when you are in a crowded room and you think you hear your name. However, after a few moments you feel as though the emerald is breathing the whispers as it glows and the leaves are slowly joining with their voices. The whispers form a song that the entire realm seems to be singing to you. It is singing your name.</p>",
        "pageimg": "images/portalrealm-left.jpg",
        "color": "#43AF89",
        "pagechoice": [{
            "choicecontent": "Investigate the source of the whispers.",
            "nextPageID": "4L"
        }, {
            "choicecontent": "Ignore it and look at the center arch.",
            "nextPageID": "3C"
        }, {
            "choicecontent": "Ignore it and inspect the right arch.",
            "nextPageID": "3R"
        }]
    }, {
        "pageID": "3C",
        "pagetitle": "Like tears in the rain",
        "pagecontent": "<p>As you approach the center arch, you hear the crack of a gun shot. You see an alleyway in some unknown city. The light up neon lights keep shifting between languages. It looks like some weird cyberpunk noir city. You hear the sound of the city, the pattering of the rain, and the slap of hard soled shoes running on the pavement. A hovering car flashes lights down the alleyway, nearly blinding you. In the light, you see a figure running towards you. They look like they are running towards you. They lock eyes with you. </p><p>&quot;Help!&quot; They cry. </p><p>&quot;You've got to help me.&quot;</p><p>You smell the rank garbage and see the fear on the face sprinting towards you. Another shot in the dark from the hovering car. This time it hits the person running at you. They cry out in agony. They are on the ground reaching out towards you. &quot;Please, help me.&quot;</p>",
        "pageimg": "images/portalrealm-center.jpg",
        "color": "#C2B1CA",
        "pagechoice": [{
            "choicecontent": "Help the fallen individual.",
            "nextPageID": "4C"
        }, {
            "choicecontent": "Go to the left arch.",
            "nextPageID": "3L"
        }, {
            "choicecontent": "Move to the right arch.",
            "nextPageID": "3R"
        }]
    }, {
        "pageID": "3R",
        "pagetitle": "See you later, Space Cowboy!",
        "pagecontent": "<p>You see the interior of a spaceship that looks like it should be in a movie set. A few crew members occasionally walk to and from different rooms that you cannot see.</p><p>You hear their muffled unclear conversations. You yell but no one reacts. They cannot hear you.</p><p>As you look at a nearby panel, you see a critical warning that no one seems to notice. A warning dialog appears: </p><p>&quot;Critical Warning Error Message 611V: The ship's pressure maintenance valve is failing. Please correct this issue immediately. Failure to do so may result in, loss of ship oxygen and loss of life.&quot;</p>",
        "pageimg": "images/portalrealm-right.jpg",
        "color": "#648473",
        "pagechoice": [{
            "choicecontent": "Save the crew.",
            "nextPageID": "4R"
        }, {
            "choicecontent": "Ignore it and return to the center arch.",
            "nextPageID": "3C"
        }, {
            "choicecontent": "Ignore it and go to the left arch.",
            "nextPageID": "3L"
        }]
    }, {
        "pageID": "4L",
        "pagetitle": "Leaf on the Wind",
        "pagecontent": "<p>As soon as you walk through the archway, the softly sung whispers stop and you are enveloped in silence. There is only the trickle of the stream. You turn around to see your way back to the Crossroads Realm archway has vanished. You panic and run back towards where you were. After a brief panic attack, you sit in the stream and try to regain some semblance of composure. </p><p>Some time later, you stand up, soaked from the waist down after sitting in the water in your panicked state. You begin to walk towards the still glowing, floating emerald.</p>",
        "pageimg": "images/591c2b5ce42517bc8af169ddc1a126fb.jpg",
        "color": "#41493B",
        "pagechoice": [{
            "choicecontent": "Next",
            "nextPageID": "5"
        }]
    }, {
        "pageID": "4C",
        "pagetitle": "A Brave New World",
        "pagecontent": "<p>The smell hits you first like a slap in the face. It smells like some untold horror that burns your nose. The sounds of the city then wash over you like were standing in front of an impossibly large amplifier playing some post-modern caustic symphony of noise. You hear a gun shot again and realize the hover car occupants are shooting at you. </p><p>You duck behind a dumpter a shot melts through the metal. These are no mere bullets and the dumpster provides as much cover as luck. Upon this realization, you run towards the bleeding woman in front of you. She reaches out and you take her bloody hand. </p>",
        "pageimg": "images/c1fcc88eb1cf3a383e25433a378e6550.png",
        "color": "#444A67",
        "pagechoice": [{
            "choicecontent": "Next",
            "nextPageID": "5"
        }]
    }, {
        "pageID": "4R",
        "pagetitle": "I'd like to speak to the Captain",
        "pagecontent": "<p>At first, you think its an alarm that is blaring. However, after it repeats, you realize the ear drum shattering sounds are supposed to be music. You look around and see none of the crew. You run from door to door. You look back and see the portal to the Crossroads realm has disappeared. You are on a ship, somewhere with no way to get back to wherever you were. And... what if the crew is not friendly. What if they shoot you on sight? You start to panic at this though, when you see the panel beginning to countdown.</p><p>Oh, right. They can't shoot you if you all run out of oxygen. You breathe deep and take a closer look at the panel before you.</p>",
        "pageimg": "images/5dece148cc1344c104e6f33ed310e848.jpg",
        "color": "#B2893A",
        "pagechoice": [{
            "choicecontent": "Next",
            "nextPageID": "5"
        }]
    }, {
        "pageID": "A",
        "pagetitle": "Your alarm clock wakes you up.",
        "pagecontent": "<p>You feel the other side of your bed. It is empty and cold. Your spouse has already left for their job. It is your day to get the kids up and out to school.</p><p>You go downstairs to the smell of coffee and the silence of the early morning.</p><p>Your spouse getting a new job means you have to get the kids ready for school.</p>",
        "pageimg": "images/ALARMCLOCK.jpg",
        "color": "#504d66",
        "pagechoice": [{
            "choicecontent": "Walk down the hall to wake up the kids.",
            "nextPageID": "B"
        }]
    }, {
        "pageID": "B",
        "pagetitle": "One of those days...",
        "pagecontent": "<p>You start making breakfast and putting together lunches for the kids. Your wee tyrants have laid havoc to the living room. You ask them to help clean up but they only want to play this morning. It is going to be one of those days.</p><p>You finish their lunches, manage to get them dressed and look at the clock. They are about to miss the bus to school. You rush them out of the house and barely make it.</p><p>You lock the house and unlock your car.</p>",
        "pageimg": "images/daiga-ellaby-JZ51o_-UOY8-unsplash.jpg",
        "color": "#c28b36",
        "pagechoice": [{
            "choicecontent": "Get in your car.",
            "nextPageID": "C"
        }]
    }, {
        "pageID": "C",
        "pagetitle": "The Morning Commute",
        "pagecontent": "<p>You turn the keys and hear the engine turn over. The tire pressure button comes on. You really need to put more air in your tires. You queue up your weekly playlist on Spotify, hoping for the new music to cheer you up.</p><p>You sigh.</p><p>You pull out of your assigned parking space and head to the stop sign that takes you out of your neighborhood and towards work. You stop at the stop sign. This is the hardest part of every morning.</p><p>Turning right takes you to work. It is the beginning of your hour long commute. Going right means another day at a job you hate, but because of your family, you are stuck in for the foreseeable future.</p><p>Turning left takes you anywhere else. You could skip work today. You could quit your job and find something else. Maybe.</p><p>The cars behind you start honking to make your decision.</p>",
        "pageimg": "images/anwaar-ali-Aax_R3pUyzs-unsplash.jpg",
        "color": "#673940",
        "pagechoice": [{
            "choicecontent": "Turn Right. Be Responsible. Go to work.",
            "nextPageID": "D"
        }, {
            "choicecontent": "Turn left and call in sick today.",
            "nextPageID": "E"
        }]
    }, {
        "pageID": "D",
        "pagetitle": "Another day at the office...",
        "pagecontent": "<p>You pull into the parking lot at work. You are late. Hopefully, your boss is not in one of their moods again. You wave at the receptionist and go up to the third floor to your desk.</p>",
        "pageimg": "images/alex-kotliarskyi-QBpZGqEMsKg-unsplash.jpg",
        "color": "#7d7671",
        "pagechoice": [{
            "choicecontent": "Begin working.",
            "nextPageID": "F"
        }]
    }, {
        "pageID": "E",
        "pagetitle": "Cough. Cough. So Sick.",
        "pagecontent": "<p>The honking starts to overwhelm you, but the urgency clears your mind. To heck with it. You call in sick. As you pull out into traffic, you queue up the phone app in your car to call your boss letting them know you are not feeling well. The kids must have brought something home from school. You hit the gas in the turn realizing that one of the cars to your left was going a lot faster than you had previously judged. You almost get clipped by them. You yell at them while stopped at the light by your house. You press call and enter the intersection as it turns green.</p><p>'Hey Charlie, its...'</p><p>Then, you see it. The car that is about to barrel into you trying to make the light.</p><p>'Oh, shi...'</p>",
        "pageimg": "images/neonbrand-IU4vrMVc_Qc-unsplash.jpg",
        "color": "#445041",
        "pagechoice": [{
            "choicecontent": "Close your eyes and hope you live.",
            "nextPageID": "1.1"
        }]
    }, {
        "pageID": "F",
        "pagetitle": "Team work, team work, team work.",
        "pagecontent": "<p>Every morning at 10, you have to go to your team's daily meeting. You look at the clock on your computer and realize it started two minutes ago. Late again. You get up and head to the small conference room.</p><p>The meeting is already on going and everyone looks at you when you enter. Your name is called to give a progress report on what you worked on.</p>",
        "pageimg": "images/antenna-cw-cj_nFa14-unsplash.jpg",
        "color": "#D3A893",
        "pagechoice": [{
            "choicecontent": "Give your status report and tell the team what you are working on today.",
            "nextPageID": "G"
        }, {
            "choicecontent": "Say, &quot;You know what? I quit.&quot; And leave the building.",
            "nextPageID": "H"
        }]
    }, {
        "pageID": "G",
        "pagetitle": "What a drag...",
        "pagecontent": "<p>You feel the morning drag on after the conclusion of your meeting. You take a couple of calls from customers. You drink two more cups of coffee hoping the caffeine will make the day move faster. You just have to make it until lunch, then you get an entire hour to yourself.</p>",
        "pageimg": "images/andrew-neel-cckf4TsHAuw-unsplash.jpg",
        "color": "#DFD2C7",
        "pagechoice": [{
            "choicecontent": "Keep working until lunch time.",
            "nextPageID": "I"
        }]
    }, {
        "pageID": "H",
        "pagetitle": "First day of the rest of your life.",
        "pagecontent": "<p>You have never done anything like that. You didn't think you were capable of doing something so reckless.</p><p>You get in your car and pull out of the parking lot. The car to your left was going a lot faster than you had previously judged. You hit the gas as you turn. They almost got hit you. You curse at them while stopped at the light by your office. Your heart rate begins to slow while you wait at the stoplight. You queue up your favorite song to calm yourself down. You pull forward as the light turns green.</p><p>A flash of light catches your eye. You turn your head to see the car that just ran their red light barrel into you.</p>",
        "pageimg": "images/anton-murygin-r7JGrCfO8_E-unsplash.jpg",
        "color": "#BEB5B4",
        "pagechoice": [{
            "choicecontent": "Close your eyes and think of your family.",
            "nextPageID": "1.1"
        }]
    }, {
        "pageID": "I",
        "pagetitle": "First day of the rest of your life.",
        "pagecontent": "<p>Lunch is a sacred time for you. It is the only time you actually get to yourself. You go to the breakroom to eat lunch and listen to music. When you get there you smell that Gary, the office body-building obsessed meathead, has made his weird fish and egg protein lunch again in the microwave. The stink in the breakroom makes you feel nauseous. You walk out to your car to eat lunch in there instead.</p><p>After eating your lunch, you stare at the building.</p>",
        "pageimg": "images/wassim-chouak-wJLR3Rq1c4M-unsplash.jpg",
        "color": "#1D1F20",
        "pagechoice": [{
            "choicecontent": "Read your lunchtime novel until your lunch break is over.",
            "nextPageID": "J"
        }, {
            "choicecontent": "Set an alarm and nap until you have to go back in.",
            "nextPageID": "1.2"
        }, {
            "choicecontent": "Leave the office and drive around until 1PM to kill time.",
            "nextPageID": "K"
        }]
    }, {
        "pageID": "J",
        "pagetitle": "The second half of the day",
        "pagecontent": "<p>The afternoon goes even slower. It is hard to keep your eyes open. That stupid button void ruins everything. You never feel rested even though that is all you want. You drink what has to be the 6th cup of coffee. </p>",
        "pageimg": "images/you-x-ventures-Oalh2MojUuk-unsplash.jpg",
        "color": "#D2CDCA",
        "pagechoice": [{
            "choicecontent": "Keep working and drinking all the coffee until it is time to go home.",
            "nextPageID": "K"
        }]
    }, {
        "pageID": "K",
        "pagetitle": "Leaving Work",
        "pagecontent": "<p>You pull out of the parking lot and immediately press the gas to the floor as you turn. The car to your left was going a lot faster than you had judged. You almost got hit by that guy. You yell at them from your car while stopped at the light by your office. Your heart rate begins to slow while you wait at the stoplight. You queue up your favorite song to calm yourself down. You try to remember if tonight will be meatloaf or lasagna and salad for dinner. </p><p>You pull forward as the light turns green. A flash of light catches your eye. You turn your head to see the car that just ran their red light barrel into you.</p>",
        "pageimg": "images/marina-reich-MPLQfesUAhU-unsplash.jpg",
        "color": "#8D9792",
        "pagechoice": [{
            "choicecontent": "Close your eyes and think of your family.",
            "nextPageID": "1.1"
        }]
    }]
}
